# Core
brew "git"
brew "gh"
brew "curl"
brew "wget"

# Runtime
brew "node"

# Databases
brew "postgresql@17"
brew "redis"

# Dev tools
brew "jq"
brew "cloc"

# Media
brew "ffmpeg"

# Docker
cask "docker"

# Apps
cask "google-chrome"
cask "swish"
cask "cursor"
cask "cleanshot"
cask "raycast"
cask "warp"
cask "glance-chamburr"
cask "1password"
cask "1password-cli"
cask "fluidvoice"
cask "codex-app"
cask "hazel"
cask "clop"
# Microsoft apps (individual)
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-powerpoint"
cask "numi"
cask "beekeeper-studio"
cask "telegram"
cask "whatsapp"
cask "tailscale-app"
cask "domzilla-caffeine"
