# Core
brew "git"
brew "gh"
brew "curl"
brew "wget"

# Runtime
brew "node"
brew "bun"
brew "pnpm"

# Databases
brew "postgresql@17"
brew "redis"

# Dev tools
brew "fzf"
brew "ripgrep"
brew "jq"
brew "htop"
brew "tmux"
brew "neovim"

# Docker
cask "docker"

# Apps
cask "google-chrome"
cask "cursor"
cask "raycast"
cask "warp"
cask "glance-chamburr"
cask "1password"
cask "handy"
cask "codex-app"
cask "hazel"
cask "clop"
# Microsoft apps (individual)
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-powerpoint"
cask "numi"
